{
  "weapons": [
    {
      "id": "weapon-higekiri-001",
      "name": "Higekiri",
      "type": "katana",
      "owner": "char-yoshi-001",
      "description": "Yoshitsune's famous sword, known as 'Beard-cutter' in historical accounts. A well-crafted blade of exceptional quality that became legendary through its association with Yoshitsune's exploits.",
      "properties": [
        "Exceptional cutting edge",
        "Perfect balance allowing for precise fighting style",
        "Historical significance as a weapon of Minamoto no Yoshitsune"
      ],
      "history": "One of the historically significant swords associated with Minamoto no Yoshitsune. Its name 'Higekiri' ('Beard-cutter') reflects its legendary sharpness.",
      "significance": "The sword that Benkei sought as his 1000th trophy, but failed to claim, changing both warriors' destinies. A symbol of Yoshitsune's martial prowess.",
      "created_at": "2025-03-15T00:00:00Z",
      "updated_at": "2025-03-16T00:00:00Z"
    },
    {
      "id": "weapon-naginata-001",
      "name": "Benkei's Naginata",
      "type": "naginata",
      "owner": "char-benkei-001",
      "description": "Benkei's primary weapon, a traditional Japanese polearm consisting of a curved blade on a long shaft, allowing for powerful sweeping attacks and maintaining distance from opponents. Unusually large to accommodate Benkei's tremendous strength and stature.",
      "properties": [
        "Exceptionally long reach",
        "Reinforced shaft capable of blocking sword strikes",
        "Crescent blade with both cutting and piercing capabilities",
        "Oversized for normal warriors but perfectly suited to Benkei's strength"
      ],
      "history": "Wielded by Benkei during his legendary confrontation with Yoshitsune at Gojo Bridge in 1180. The weapon has become synonymous with Benkei's imposing presence on the bridge.",
      "significance": "The weapon that defined Benkei as 'The Giant of Gojo Bridge' during his collection of 999 swords. Its intimidating size serves as a physical manifestation of Benkei's overwhelming presence.",
      "created_at": "2025-03-15T00:00:00Z",
      "updated_at": "2025-03-16T00:00:00Z"
    }
  ]
}
